export default {
  '000': {
    code: '000',
    errMsg: '',
  },
  '001': {
    code: '001',
    errMsg: '缺少必要参数',
  },
  '002': {
    code: '002',
    errMsg: '存在多个根节点',
  },
  '003': {
    code: '003',
    errMsg: '存在未编辑的节点',
  },
  '004': {
    code: '004',
    errMsg: '同一路径上该节点类型个数超限',
  },
  '005': {
    code: '005',
    errMsg: '结束节点类型不正确',
  },
  '006': {
    code: '006',
    errMsg: '父节点类型个数超限',
  },
  '007': {
    code: '007',
    errMsg: '兄弟节点类型个数超限',
  },
  '008': {
    code: '008',
    errMsg: '兄弟节点类型个数超限',
  },
  '009': {
    code: '009',
    errMsg: '兄弟节点类型个数超限',
  },
  '010': {
    code: '010',
    errMsg: '子节点类型个数超限',
  },
  '011': {
    code: '011',
    errMsg: '同一路径上该节点类型个数超限',
  },
  '012': {
    code: '012',
    errMsg: '当前节点入度超限',
  },
  '013': {
    code: '013',
    errMsg: '当前节点出度超限',
  },
  '014': {
    code: '014',
    errMsg: '当前画布不包含该节点类型',
  },
  '015': {
    code: '015',
    errMsg: '优先级定义相同',
  },
  '016': {
    code: '016',
    errMsg: '必须包含某类型的兄弟节点',
  },
  '017': {
    code: '017',
    errMsg: '该风险域只开放一层识别集',
  },
}
